# ( 05-1-2024 ) CASE STUDY IS DOWN

In [23]:
import pandas as pd
import numpy as np

In [24]:
np.random.seed(32)
id_1= np.random.randint(100, 115, 10)
id_1=list(set(id_1))

In [25]:
np.random.seed(32)
id_2= np.random.randint(100, 115, 10)
id_2=list(set(id_2))

In [26]:
id3 = id_1.union(id_2)
id3

AttributeError: 'list' object has no attribute 'union'

In [27]:
df1 = pd.DataFrame({'id':id_1,
                   'name':[str(ele) for ele in id_1],
                    'profit':np.random.randint(1000, 2000, len(id_1))
                   })
df1

    id name  profit
0  103  103    1510
1  105  105    1601
2  106  106    1771
3  107  107    1997
4  108  108    1234
5  111  111    1009
6  112  112    1004
7  114  114    1651

In [28]:
df2 = pd.DataFrame({'id':id_2,
                   'name':[str(ele) for ele in id_2],
                    'loss':np.random.randint(150,250, len(id_2))
                   })
df2

    id name  loss
0  103  103   231
1  105  105   153
2  106  106   215
3  107  107   184
4  108  108   185
5  111  111   174
6  112  112   192
7  114  114   232

In [29]:
pd.merge(df1 , df2)

    id name  profit  loss
0  103  103    1510   231
1  105  105    1601   153
2  106  106    1771   215
3  107  107    1997   184
4  108  108    1234   185
5  111  111    1009   174
6  112  112    1004   192
7  114  114    1651   232

In [30]:
x1 = df1.copy(), df2.copy()

In [31]:
x1.columns = [ele+'-1' for ele in df1.columns]
x2.columns = [ele+'-1' for ele in df1.columns]

AttributeError: 'tuple' object has no attribute 'columns'

In [32]:
pd.merge(df1, df2, on =  'id')

    id name_x  profit name_y  loss
0  103    103    1510    103   231
1  105    105    1601    105   153
2  106    106    1771    106   215
3  107    107    1997    107   184
4  108    108    1234    108   185
5  111    111    1009    111   174
6  112    112    1004    112   192
7  114    114    1651    114   232

In [33]:
pd.merge(df1, df2 , on = ['id', 'name'], how = 'outer')

    id name  profit  loss
0  103  103    1510   231
1  105  105    1601   153
2  106  106    1771   215
3  107  107    1997   184
4  108  108    1234   185
5  111  111    1009   174
6  112  112    1004   192
7  114  114    1651   232

In [34]:
pd.merge(x1 , x2, left_on)

NameError: name 'left_on' is not defined

In [35]:
x1, x2 = df1.copy(), df2.copy()

# CASE STUDY

In [3]:
import pandas as pd , numpy as np

In [4]:
members=pd.read_csv(r'C:\Users\HP\Downloads\members.csv')
menu=pd.read_csv(r'C:\Users\HP\Downloads\menu.csv')
sales=pd.read_csv(r'C:\Users\HP\Downloads\sales.csv')

In [5]:
members

  customer_id   join_date
0           A  2021-01-07
1           B  2021-01-09

In [6]:
menu

   product_id product_name  price
0           1        sushi     10
1           2        curry     15
2           3        ramen     12

In [7]:
sales

   customer_id  order_date  product_id
0            A  2021-01-01           1
1            A  2021-01-01           2
2            A  2021-01-07           2
3            A  2021-01-10           3
4            A  2021-01-11           3
5            A  2021-01-11           3
6            B  2021-01-01           2
7            B  2021-01-02           2
8            B  2021-01-04           1
9            B  2021-01-11           1
10           B  2021-01-16           3
11           B  2021-02-01           3
12           C  2021-01-01           3
13           C  2021-01-01           3
14           C  2021-01-07           3

In [8]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  15 non-null     object
 1   order_date   15 non-null     object
 2   product_id   15 non-null     int64
dtypes: int64(1), object(2)
memory usage: 492.0+ bytes

In [20]:
merge = pd.merge(sales,menu, on ='product_id', how = 'left')
merge = pd.merge(merge,members, on ='customer_id',how = 'left')
merge

   customer_id order_date  product_id product_name  price  join_date
0            A 2021-01-01           1        sushi     10 2021-01-07
1            A 2021-01-01           2        curry     15 2021-01-07
2            A 2021-01-07           2        curry     15 2021-01-07
3            A 2021-01-10           3        ramen     12 2021-01-07
4            A 2021-01-11           3        ramen     12 2021-01-07
5            A 2021-01-11           3        ramen     12 2021-01-07
6            B 2021-01-01           2        curry     15 2021-01-09
7            B 2021-01-02           2        curry     15 2021-01-09
8            B 2021-01-04           1        sushi     10 2021-01-09
9            B 2021-01-11           1        sushi     10 2021-01-09
10           B 2021-01-16           3        ramen     12 2021-01-09
11           B 2021-02-01           3        ramen     12 2021-01-09
12           C 2021-01-01           3        ramen     12        NaT
13           C 2021-01-01           3        ramen     12        NaT
14           C 2021-01-07           3        ramen     12        NaT

In [9]:
sales['order_date'] = sales['order_date'].astype('datetime64[ns]')
members['join_date'] = members['join_date'].astype('datetime64[ns]')

###  what is the total amount each customer spent at the restaurant ?

In [10]:
z = pd.merge(sales,menu, on = 'product_id', how = 'inner')
z

   customer_id order_date  product_id product_name  price
0            A 2021-01-01           1        sushi     10
1            B 2021-01-04           1        sushi     10
2            B 2021-01-11           1        sushi     10
3            A 2021-01-01           2        curry     15
4            A 2021-01-07           2        curry     15
5            B 2021-01-01           2        curry     15
6            B 2021-01-02           2        curry     15
7            A 2021-01-10           3        ramen     12
8            A 2021-01-11           3        ramen     12
9            A 2021-01-11           3        ramen     12
10           B 2021-01-16           3        ramen     12
11           B 2021-02-01           3        ramen     12
12           C 2021-01-01           3        ramen     12
13           C 2021-01-01           3        ramen     12
14           C 2021-01-07           3        ramen     12

In [11]:
z.groupby('customer_id')['price'].sum()

customer_id
A    76
B    74
C    36
Name: price, dtype: int64

###  How many days has each customer vistied the restrunt

In [12]:
sales.groupby('customer_id')['order_date'].nunique()

customer_id
A    4
B    6
C    2
Name: order_date, dtype: int64

###  what was the first item from the menu purchased by each customer ?

In [22]:
marged_df['rank'] = merged_df.groupby('customer_id')['order_date'].rank(method='dense')
marged_df

NameError: name 'merged_df' is not defined

In [23]:
first_purchase_df = first_purchase_df.groupby('customer_id').first().reset_index()
first_purchase_df

NameError: name 'first_purchase_df' is not defined

### What is the most purchased item on the menu and how many times was it purchased by all customers?

In [24]:
sales['product_id'].value_counts()

product_id
3    8
2    4
1    3
Name: count, dtype: int64

In [25]:
menu

   product_id product_name  price
0           1        sushi     10
1           2        curry     15
2           3        ramen     12

In [26]:
 most_purchased_item = merge['product_name'].value_counts().idxmax()
count_most_purchased_item = merge['product_name'].value_counts().max()
print("\nMost Purchased Item on the Menu:")
print("Product Name:", most_purchased_item)
print("Count:", count_most_purchased_item)

Most Purchased Item on the Menu:
Product Name: ramen
Count: 8

### Which item was the most popular for each customer?

In [27]:
most_popular_of_customer = merge.groupby('customer_id')['product_name'].value_counts().groupby('customer_id').idxmax()
most_popular_of_customer

customer_id
A    (A, ramen)
B    (B, curry)
C    (C, ramen)
Name: count, dtype: object

### Which item was purchased first by the customer after they became a member?

In [29]:
 first_purchase_after_join = (merge[merge['order_date'] >= merge['join_date']]
                             .groupby('customer_id')['product_name'].first())

first_purchase_after_join

customer_id
A    curry
B    sushi
Name: product_name, dtype: object

In [30]:
total_items_amount_before_join = (merge[merge['order_date'] < merge['join_date']]
                                  .groupby('customer_id').agg({'product_name': 'count', 'price': 'sum'}))
print("\nTotal Items and Amount Spent for Each Member Before Joining:")
print(total_items_amount_before_join)

Total Items and Amount Spent for Each Member Before Joining:
             product_name  price
customer_id
A                       2     25
B                       3     40

### Which item was purchased just before the customer became a member?

In [33]:
first_purchase_after_join = (merge[merge['order_date'] >= merge['join_date']]
                             .groupby('customer_id')['product_name'].first())

first_purchase_after_join

customer_id
A    curry
B    sushi
Name: product_name, dtype: object

### If each  $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?

In [31]:
merge['points'] = merge['price'] * 10
merge.loc[merge['product_name'] == 'sushi', 'points'] *= 2

total_points_by_customer = merge.groupby('customer_id')['points'].sum()
print("\nTotal Points for Each Customer:")
print(total_points_by_customer)

Total Points for Each Customer:
customer_id
A    860
B    940
C    360
Name: points, dtype: int64

### In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?

In [32]:
joined_first_week_points = merge[(merge['order_date'] >= merge['join_date']) &
                                     (merge['order_date'] <= merge['join_date'] +
                                      pd.Timedelta(days=6))]['points']
total_points_customer_A = joined_first_week_points[merge['customer_id'] == 'A'].sum()
total_points_customer_B = joined_first_week_points[merge['customer_id'] == 'B'].sum()

print("\nPoints for Customer A in the First Week After Joining:", total_points_customer_A)
print("Points for Customer B in the First Week After Joining:", total_points_customer_B)

Points for Customer A in the First Week After Joining: 510
Points for Customer B in the First Week After Joining: 200